olliw42/stm32ll-lib/stdstm32-uart-template.h
//*******************************************************
// Copyright (c) OlliW, OlliW42, www.olliw.eu
// GPL3
// https://www.gnu.org/licenses/gpl-3.0.de.html
//*******************************************************
// my stripped down UART standard library
// only ISR, no DMA, no wait and tmo rx functions, no convenience functions
//*******************************************************
// Interface:
//
// #define UART$_USE_UART1, UART$_USE_UART2, UART$_USE_UART3, UART$_USE_UART3_REMAPPED, UART$_USE_UART4, UART$_USE_UART5
// #define UART$_USE_LPUART1, UART$_USE_LPUART1_REMAPPED
// 
// #define UART$_BAUD
//
// #define UART$_USE_TX
// #define UART$_TXBUFSIZE
// #define UART$_USE_TX_ISR
// #define UART$_USE_TX_DMA
//
// #define UART$_USE_RX
// #define UART$_RXBUFSIZE
//
// #define UART$_IRQ_PRIORITY
//
// #define UART$_USE_RXERRORCOUNT
//
// #define UART$_RX_CALLBACK_FULL(c)
// #define UART$_TC_CALLBACK() // ATTENTION: when used, one never should trigger TC isr without a byte written to the tx buffer
//
//*******************************************************
#ifndef STDSTM32_UART$_H
#define STDSTM32_UART$_H
#ifdef __cplusplus
extern "C" {
#endif


//-------------------------------------------------------
// Enums
//-------------------------------------------------------
// in order to not introduce hardware dependency upstream
// we define our own enums for parity and stopbits

#ifndef UART_ENUMS
#define UART_ENUMS

typedef enum {
  XUART_PARITY_NO = LL_USART_PARITY_NONE, // XUART_xxx to avoid overlap with HAL
  XUART_PARITY_EVEN = LL_USART_PARITY_EVEN,
  XUART_PARITY_ODD = LL_USART_PARITY_ODD,
  XUART_PARITY_MAKEITU32 = UINT32_MAX,
} UARTPARITYENUM;

typedef enum {
  UART_STOPBIT_0_5 = LL_USART_STOPBITS_0_5,
  UART_STOPBIT_1 = LL_USART_STOPBITS_1,
  UART_STOPBIT_1_5 = LL_USART_STOPBITS_1_5,
  UART_STOPBIT_2 = LL_USART_STOPBITS_2,
  UART_STOPBIT_MAKEITU32 = UINT32_MAX,
} UARTSTOPBITENUM;

#endif


//-------------------------------------------------------
// Defines
//-------------------------------------------------------

#include "stdstm32-peripherals.h"

#if (defined UART$_USE_TX_ISR) && (!defined UART$_USE_TX)
  #error UART$_USE_TX_ISR used without UART$_USE_TX!
#endif
#if (defined UART$_USE_RXERRORCOUNT) && (!defined UART$_USE_RX)
  #error UART$_USE_RXERRORCOUNT used without UART$_USE_RX!
#endif

#ifdef UART$_USE_TX_DMA
  #error UART$_USE_TX_DMA not supported by this library!
#endif


#ifndef UART$_BAUD
  #define UART$_BAUD             115200UL // 9600UL
#endif


#ifdef UART$_USE_TX_ISR
  #ifndef UART$_TXBUFSIZE
    #define UART$_TXBUFSIZE      256 // MUST be 2^N
  #endif
  #if UART$_TXBUFSIZE < 2
    #error UART$_TXBUFSIZE must be larger than 1 !
  #elif ((UART$_TXBUFSIZE & (UART$_TXBUFSIZE-1)) != 0)
    #error UART$_TXBUFSIZE must be a power of 2 !
  #endif

  #define UART$_TXBUFSIZEMASK  (UART$_TXBUFSIZE-1)

  volatile char uart$_txbuf[UART$_TXBUFSIZE];
  volatile uint16_t uart$_txwritepos; // pos at which the last byte was stored
  volatile uint16_t uart$_txreadpos; // pos at which the next byte is to be fetched
#endif


#ifdef UART$_USE_RX
  #ifndef UART$_RXBUFSIZE
    #define UART$_RXBUFSIZE      256 //128 //MUST be 2^N
  #endif
  #if UART$_RXBUFSIZE < 2
    #error UART$_RXBUFSIZE must be larger than 1 !
  #elif ((UART$_RXBUFSIZE & (UART$_RXBUFSIZE-1)) != 0)
    #error UART$_RXBUFSIZE must be a power of 2 !
  #endif

  #define UART$_RXBUFSIZEMASK  (UART$_RXBUFSIZE-1)

  volatile char uart$_rxbuf[UART$_RXBUFSIZE];
  volatile uint16_t uart$_rxwritepos; // pos at which the last byte was stored
  volatile uint16_t uart$_rxreadpos; // pos at which the next byte is to be fetched

  #ifdef UART$_USE_RXERRORCOUNT
  volatile uint32_t uart$_errorcnt_rxnoise;
  volatile uint32_t uart$_errorcnt_rxframe;
  volatile uint32_t uart$_errorcnt_rxoverrun;
  #endif
#endif


#if defined UART$_USE_UART1 || defined UART$_USE_UART1_REMAPPED || defined UART$_USE_UART1_REMAPPED2
  #define UART$_UARTx             USART1
  #ifdef UART$_USE_UART1
    #define UART$_TX_IO           IO_PA9
    #define UART$_RX_IO           IO_PA10
  #elif defined UART$_USE_UART1_REMAPPED
    #define UART$_TX_IO           IO_PB6
    #define UART$_RX_IO           IO_PB7
  #elif defined UART$_USE_UART1_REMAPPED2 // only G4
    #define UART$_TX_IO           IO_PC4 // on G4
    #define UART$_RX_IO           IO_PC5
  #endif
  #define UART$_IO_AF             IO_AF_7
  #define UART$_IRQn              USART1_IRQn
  #define UART$_IRQHandler        USART1_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #endif

#elif defined UART$_USE_UART2 || defined UART$_USE_UART2_REMAPPED || defined UART$_USE_UART2_REMAPPED2 || defined UART$_USE_UART2_REMAPPED3
  #define UART$_UARTx             USART2
  #ifdef UART$_USE_UART2
    #define UART$_TX_IO           IO_PA2
    #define UART$_RX_IO           IO_PA3
  #elif defined UART$_USE_UART2_REMAPPED
    #define UART$_TX_IO           IO_PD5
    #define UART$_RX_IO           IO_PD6
  #elif defined UART$_USE_UART2_REMAPPED2 // only G4
    #define UART$_TX_IO           IO_PB3
    #define UART$_RX_IO           IO_PB4
  #elif defined UART$_USE_UART2_REMAPPED3 // only G4 // ATTENTION: PA14 overlaps with SWCLK
    #define UART$_TX_IO           IO_PA14
    #define UART$_RX_IO           IO_PA15
  #endif
  #define UART$_IO_AF             IO_AF_7
  #define UART$_IRQn              USART2_IRQn
  #define UART$_IRQHandler        USART2_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #endif

#elif defined UART$_USE_UART3 || defined UART$_USE_UART3_REMAPPED
  #define UART$_UARTx             USART3
  #if defined UART$_USE_UART3 && defined STM32F3
    #define UART$_TX_IO           IO_PB8
    #define UART$_RX_IO           IO_PB9
  #elif defined UART$_USE_UART3
    #define UART$_TX_IO           IO_PB10
    #define UART$_RX_IO           IO_PB11
  #else
    #define UART$_TX_IO           IO_PC10
    #define UART$_RX_IO           IO_PC11
  #endif
  #define UART$_IO_AF             IO_AF_7
  #define UART$_IRQn              USART3_IRQn
  #define UART$_IRQHandler        USART3_IRQHandler
  #if defined STM32F1
  #elif defined STM32F3
  #elif defined STM32F7
  #elif defined STM32G4
  #elif defined STM32L4
  #endif

#elif defined UART$_USE_UART4 || defined UART$_USE_UART4_REMAPPED
  #define UART$_UARTx             UART4
  #ifdef UART$_USE_UART4
    #define UART$_TX_IO           IO_PC10
    #define UART$_RX_IO           IO_PC11
  #else
    #define UART$_TX_IO           IO_PA0 // only F7 !
    #define UART$_RX_IO           IO_PA1
  #endif
  #define UART$_IRQn              UART4_IRQn
  #define UART$_IRQHandler        UART4_IRQHandler
  #if defined STM32F1
    #define UART$_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UART$ IO_AF & DMA for F3 still TODO
  #elif defined STM32F7
    #define UART$_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UART$_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UART$_USE_UART5
  #define UART$_UARTx             UART5
  #define UART$_TX_IO             IO_PC12
  #define UART$_RX_IO             IO_PD2
  #define UART$_IRQn              UART5_IRQn
  #define UART$_IRQHandler        UART5_IRQHandler
  #if defined STM32F1
    #define UART$_IO_AF           IO_AF_DEFAULT
  #elif defined STM32F3
    #warning UART$ IO_AF & DMA for F3 still TODO //TODO
  #elif defined STM32F7
    #define UART$_IO_AF           IO_AF_8
  #elif defined STM32G4
    #define UART$_IO_AF           IO_AF_5
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UART$_USE_UART6 || defined UART$_USE_UART6_REMAPPED
  #define UART$_UARTx             USART6
  #ifdef UART$_USE_UART6
    #define UART$_TX_IO           IO_PC6
    #define UART$_RX_IO           IO_PC7
  #else
    #define UART$_TX_IO           IO_PG14
    #define UART$_RX_IO           IO_PG9
  #endif
  #define UART$_IO_AF             IO_AF_8
  #define UART$_IRQn              USART6_IRQn
  #define UART$_IRQHandler        USART6_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART6 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

