olliw42/stm32ll-lib/stdstm32-uart-template.h
#elif defined UART$_USE_UART7 || defined UART$_USE_UART7_REMAPPED
  #define UART$_UARTx             UART7
  #ifdef UART$_USE_UART7
    #define UART$_TX_IO           IO_PE8
    #define UART$_RX_IO           IO_PE7
  #else
    #define UART$_TX_IO           IO_PF7
    #define UART$_RX_IO           IO_PF6
  #endif
  #define UART$_IO_AF             IO_AF_8
  #define UART$_IRQn              UART7_IRQn
  #define UART$_IRQHandler        UART7_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART7 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UART$_USE_UART8
  #define UART$_UARTx             UART8
  #define UART$_TX_IO             IO_PE1
  #define UART$_RX_IO             IO_PE0
  #define UART$_IO_AF             IO_AF_8
  #define UART$_IRQn              UART8_IRQn
  #define UART$_IRQHandler        UART8_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32G4
    #error UART8 NOT AVAILABLE !
  #elif defined STM32F7
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#elif defined UART$_USE_LPUART1 || defined UART$_USE_LPUART1_REMAPPED
  #define UART$_UARTx             LPUART1
  #ifdef UART$_USE_LPUART1
    #define UART$_TX_IO           IO_PA2
    #define UART$_RX_IO           IO_PA3
  #elif defined UART$_USE_LPUART1_REMAPPED
    #define UART$_TX_IO           IO_PC1
    #define UART$_RX_IO           IO_PC0
  #endif
  #define UART$_IO_AF             IO_AF_12
  #define UART$_IRQn              LPUART1_IRQn
  #define UART$_IRQHandler        LPUART1_IRQHandler
  #if defined STM32F1 || defined STM32F3 || defined STM32F7
    #error UART8 NOT AVAILABLE !
  #elif defined STM32G4
  #elif defined STM32L4
    #error TODO ?!?
  #endif

#else
  #error No UART$_USE_UARTx defined!
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Also, both USART and LPUART use the same structure USART_TypeDef.
// All LL_USART_xx() and LL_LPUART_xx() functions which only use it and relate to flags or 
// registers can be used for both USART and LPUART. 
// Below we simply use the LL_USART_xx() functions for both.


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  USART_SR_RXNE
  #define FLAG_SR_ORE   USART_SR_ORE
  #define FLAG_SR_NE    USART_SR_NE
  #define FLAG_SR_FE    USART_SR_FE
  #define FLAG_SR_TXE   USART_SR_TXE
  #define FLAG_SR_TC    USART_SR_TC
#elif defined STM32F3 || defined STM32F7 || defined STM32L4
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  USART_ISR_RXNE
  #define FLAG_SR_ORE   USART_ISR_ORE
  #define FLAG_SR_NE    USART_ISR_NE
  #define FLAG_SR_FE    USART_ISR_FE
  #define FLAG_SR_TXE   USART_ISR_TXE
  #define FLAG_SR_TC    USART_ISR_TC
#elif defined STM32G4
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   USART_ISR_ORE
  #define FLAG_SR_NE    USART_ISR_NE
  #define FLAG_SR_FE    USART_ISR_FE
  #define FLAG_SR_TXE   USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    USART_ISR_TC
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UART$_USE_RX || defined UART$_USE_TX_ISR

void UART$_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UART$_UARTx, REG_SR); // read USART_SR register

#ifdef UART$_USE_RX
  if (usart_sr & FLAG_SR_RXNE) {
#ifdef UART$_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uart$_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uart$_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uart$_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UART$_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UART$_RX_CALLBACK_FULL
    UART$_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uart$_rxwritepos + 1) & UART$_RXBUFSIZEMASK;
    if (uart$_rxreadpos != next) { // fifo not full
      uart$_rxbuf[next] = usart_dr;
      uart$_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UART$_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#elif defined STM32F3
  #warning UART$ F3 check clear flags, should be LL !?
  // ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  LL_USART_WriteReg(UART$_UARTx, ICR, (USART_ICR_ORECF | USART_ICR_NCF | USART_ICR_FECF | USART_ICR_PECF | USART_ICR_IDLECF));
#elif defined STM32F7
  #warning UART$ F7 check clear flags, should be LL !?
  // these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UART$_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NCF | USART_ICR_FECF | USART_ICR_PECF));
#elif defined STM32G4
  LL_USART_WriteReg(UART$_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NECF | USART_ICR_FECF | USART_ICR_PECF));
#elif defined STM32L4
  #warning UART$ L4 check clear flags, should be LL !?
  LL_USART_WriteReg(UART$_UARTx, ICR, (USART_ICR_IDLECF | USART_ICR_ORECF | USART_ICR_NECF | USART_ICR_FECF | USART_ICR_PECF));
#endif
#endif

#ifdef UART$_USE_TX_ISR
  if (usart_sr & FLAG_SR_TXE) {
    if (uart$_txwritepos != uart$_txreadpos) { // fifo not empty
      uart$_txreadpos = (uart$_txreadpos + 1) & UART$_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UART$_UARTx, uart$_txbuf[uart$_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UART$_UARTx); // disable interrupt when empty
#ifdef UART$_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UART$_UARTx); // now enable TC interrupt
      LL_USART_EnableIT_TC(UART$_UARTx);
#endif
    }
  }

#ifdef UART$_TC_CALLBACK
  if (usart_sr & FLAG_SR_TC) {
    LL_USART_DisableIT_TC(UART$_UARTx);
    LL_USART_ClearFlag_TC(UART$_UARTx);
    UART$_TC_CALLBACK();
  }
#endif
#endif
}

#endif // defined UART$_USE_RX || defined UART$_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UART$_USE_TX

uint16_t uart$_putc(char c)
{
#ifndef UART$_USE_TX_ISR
  while (!LL_USART_IsActiveFlag_TC(UART$_UARTx)) {}
  LL_USART_TransmitData8(UART$_UARTx, c);
  return 1;
#else
  uint16_t next = (uart$_txwritepos + 1) & UART$_TXBUFSIZEMASK;
  if (uart$_txreadpos != next) { // fifo not full // this is isr safe, works also if readpos has changed in the meanwhile
    uart$_txbuf[next] = c;
    uart$_txwritepos = next;
    LL_USART_EnableIT_TXE(UART$_UARTx); // enable interrupt // then TDR is empty, the TXE bit is set, and hence the isr is triggered
    return 1;
  }
  return 0;
#endif
}


